
## :x: Apply Failed (datadog-sandbox)

[CI link](https://github.com/dd-japan/ctf-terraform/actions/runs/15431375920)



<pre><code>Error: googleapi: Error 403: You must verify site or domain ownership at https://search.google.com/search-console/welcome?new_url_prefix=image-store.com, forbidden

  with google_storage_bucket.static-site,
  on main.tf line 1, in resource &#34;google_storage_bucket&#34; &#34;static-site&#34;:
   1: resource &#34;google_storage_bucket&#34; &#34;static-site&#34; {</code></pre>

<details><summary>Details (Click me)</summary>

```hcl
data.google_service_account.terraform_sa: Reading...
google_iam_workload_identity_pool.github_pool: Refreshing state... [id=projects/datadog-sandbox/locations/global/workloadIdentityPools/github-actions-pool]
google_storage_bucket.test_bucket_datadog_japan: Refreshing state... [id=test-bucket-for-terraform-example-6789]
data.google_service_account.terraform_sa: Read complete after 0s [id=projects/datadog-sandbox/serviceAccounts/yuta-sa@datadog-sandbox.iam.gserviceaccount.com]
google_service_account_iam_member.workload_identity_account_iam: Refreshing state... [id=projects/datadog-sandbox/serviceAccounts/yuta-sa@datadog-sandbox.iam.gserviceaccount.com/roles/iam.workloadIdentityUser/principalSet://iam.googleapis.com/projects/958371799887/locations/global/workloadIdentityPools/github-actions-pool/attribute.repository/dd-japan/ctf-terraform]
google_iam_workload_identity_pool_provider.github_provider: Refreshing state... [id=projects/datadog-sandbox/locations/global/workloadIdentityPools/github-actions-pool/providers/github-provider]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # google_storage_bucket.static-site will be created
  + resource "google_storage_bucket" "static-site" {
      + effective_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + force_destroy               = true
      + id                          = (known after apply)
      + location                    = "EU"
      + name                        = "image-store.com"
      + project                     = (known after apply)
      + project_number              = (known after apply)
      + public_access_prevention    = (known after apply)
      + rpo                         = (known after apply)
      + self_link                   = (known after apply)
      + storage_class               = "STANDARD"
      + terraform_labels            = {
          + "goog-terraform-provisioned" = "true"
        }
      + uniform_bucket_level_access = true
      + url                         = (known after apply)

      + cors {
          + max_age_seconds = 3600
          + method          = [
              + "GET",
              + "HEAD",
              + "PUT",
              + "POST",
              + "DELETE",
            ]
          + origin          = [
              + "http://image-store.com",
            ]
          + response_header = [
              + "*",
            ]
        }

      + soft_delete_policy (known after apply)

      + versioning (known after apply)

      + website {
          + main_page_suffix = "index.html"
          + not_found_page   = "404.html"
        }
    }

  # google_storage_bucket.test_bucket_datadog_japan will be destroyed
  # (because google_storage_bucket.test_bucket_datadog_japan is not in configuration)
  - resource "google_storage_bucket" "test_bucket_datadog_japan" {
      - default_event_based_hold    = false -> null
      - effective_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - enable_object_retention     = false -> null
      - force_destroy               = true -> null
      - id                          = "test-bucket-for-terraform-example-6789" -> null
      - labels                      = {} -> null
      - location                    = "US" -> null
      - name                        = "test-bucket-for-terraform-example-6789" -> null
      - project                     = "datadog-sandbox" -> null
      - project_number              = 958371799887 -> null
      - public_access_prevention    = "inherited" -> null
      - requester_pays              = false -> null
      - rpo                         = "DEFAULT" -> null
      - self_link                   = "https://www.googleapis.com/storage/v1/b/test-bucket-for-terraform-example-6789" -> null
      - storage_class               = "STANDARD" -> null
      - terraform_labels            = {
          - "goog-terraform-provisioned" = "true"
        } -> null
      - uniform_bucket_level_access = true -> null
      - url                         = "gs://test-bucket-for-terraform-example-6789" -> null

      - hierarchical_namespace {
          - enabled = false -> null
        }

      - soft_delete_policy {
          - retention_duration_seconds = 0 -> null
            # (1 unchanged attribute hidden)
        }
    }

Plan: 1 to add, 0 to change, 1 to destroy.
google_storage_bucket.test_bucket_datadog_japan: Destroying... [id=test-bucket-for-terraform-example-6789]
google_storage_bucket.static-site: Creating...
google_storage_bucket.test_bucket_datadog_japan: Destruction complete after 1s

Error: googleapi: Error 403: You must verify site or domain ownership at https://search.google.com/search-console/welcome?new_url_prefix=image-store.com, forbidden

  with google_storage_bucket.static-site,
  on main.tf line 1, in resource "google_storage_bucket" "static-site":
   1: resource "google_storage_bucket" "static-site" {


```

</details>

<!-- github-comment: {"Command":"apply","JobName":"terraform-apply","PRNumber":9,"Program":"tfcmt","SHA1":"2a750e3d366d294069df4c395d863983a59f0e36","Target":"datadog-sandbox","Vars":{},"WorkflowName":"terraform apply"} -->